app/Controllers/Home.php

    public function detallesEvento()
    {
        $actualizar = $this->request->getPost("actualizar");
        echo 'Valor de actualizar: '.$actualizar;
        $evento = new Evento();
        if($actualizar == ""){
            $fechaFin = $this->request->getPost("event-end-date");
            echo 'Valor de fechaFin: '.$fechaFin;
                $data = [
                    'id' => '',
                    'evento' => $this->request->getPost("evento"),
                    'tipo' => $this->request->getPost("event-level"),
                    'fechaInicio' => $this->request->getPost("event-start-date"),
                    'fechaFin' => $this->request->getPost("event-end-date")
                ];
                $evento->insert($data);
---
INSERT INTO `eventos` (`id`, `evento`, `tipo`, `fechaInicio`, `fechaFin`) VALUES ('', 'dsafs', 'Work', '2022-12-31', '2023-01-01')

    public function deleteEvento(){
        $id = $this->request->getPost("eliminar");
        echo $id;
        $evento = new Evento();
        $evento->where('id',$id)->delete($id);
---
DELETE FROM `eventos`
WHERE `id` = '11'
AND `id` IN ('11')